---
kind: type
id: T:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint
source: html/6bb869f5-c44f-4b94-9a73-7fccdc5f47ef.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint

Represents an endpoint (start or end) of a horizontal curve in Alignment geometry.

## Syntax (C#)
```csharp
public class HorizontalCurveEndpoint
```